In [25]:
import pandas as pd

In [26]:
df = pd.read_excel("/Users/finn/Documents/GitHub/data/e4e8/fred_current_account.xls", skiprows=14)
df.rename(columns={
    "IEABCPI": "Primary Income",
    "IEABCSI": "Secondary Income",
    "BOPSTB": "Services",
    "BOPGTB": "Goods",
    "IEABC" : "Current Account"}, inplace=True)

In [27]:
# Keep only 2017 onwards
df = df[df["observation_date"] >= "2017-01-01"]

In [28]:
df = df.melt(id_vars=["observation_date"], value_vars=["Primary Income", "Secondary Income", "Services", "Goods", "Current Account"], var_name="Series", value_name="Value")
# dates to Quarters e.g. 'Q1 2017'
df["Quarter"] = df["observation_date"].dt.to_period("Q")

In [30]:
# multiply all values by 1,000,000
df["Value"] = df["Value"] * 1000000

In [31]:
df.to_json("/Users/finn/Documents/GitHub/data/e4e8/current_account.json", orient="records", date_format="iso")

In [32]:
df

    observation_date           Series         Value Quarter
0         2017-01-01   Primary Income  5.932700e+10  2017Q1
1         2017-04-01   Primary Income  5.729300e+10  2017Q2
2         2017-07-01   Primary Income  6.835800e+10  2017Q3
3         2017-10-01   Primary Income  7.296300e+10  2017Q4
4         2018-01-01   Primary Income  6.933500e+10  2018Q1
..               ...              ...           ...     ...
120       2022-01-01  Current Account -2.807820e+11  2022Q1
121       2022-04-01  Current Account -2.372070e+11  2022Q2
122       2022-07-01  Current Account -2.190020e+11  2022Q3
123       2022-10-01  Current Account -2.068050e+11  2022Q4
124       2023-01-01  Current Account           NaN  2023Q1

[125 rows x 4 columns]

In [33]:
int(-2.068050e+11)

-206805000000